app/controllers/fields_controller.rb

  def index
    @fields = Field.all
---
SELECT "fields".* FROM "fields"

  def new
    @field = Field.new
    @farms = Farm.all
---
SELECT "farms".* FROM "farms"

  def edit
    @farms = Farm.all
---
SELECT "farms".* FROM "farms"

  def create
    @field = Field.new(field_params)
    @farms = Farm.all

    respond_to do |format|
      if @field.save
---
SELECT "farms".* FROM "farms"
INSERT INTO "fields" ("name", "area", "area_unit", "created_at", "updated_at", "farm_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "MyString"], ["area", 9.99], ["area_unit", "acres"], ["created_at", "2018-04-22 02:46:33.108065"], ["updated_at", "2018-04-22 02:46:33.108065"], ["farm_id", 980190962]]

  def update
    @farms = Farm.all
    respond_to do |format|
      if @field.update(field_params)
---
SELECT "farms".* FROM "farms"
UPDATE "fields" SET "farm_id" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["farm_id", 980190962], ["updated_at", "2018-04-22 02:46:33.098982"], ["id", 980190962]]

  def destroy
    @field.destroy
---
DELETE FROM "fields" WHERE "fields"."id" = ?  [["id", 980190962]]

    def set_field
      @field = Field.find(params[:id])
---
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]